#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_service.nginx_service will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx_service"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + namespace        = "nginx"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # helm_release.external_dns will be updated in-place
  ~ resource "helm_release" "external_dns" {
        atomic                     = false
      ~ chart                      = "external-dns" -> "bitnami/external-dns"
        cleanup_on_fail            = false
        dependency_update          = false
        disable_crd_hooks          = false
      + disable_openapi_validation = false
        disable_webhooks           = false
        force_update               = false
        id                         = "external-dns"
        max_history                = 0
        metadata                   = [
            {
                chart     = "external-dns"
                name      = "external-dns"
                namespace = "external-dns"
                revision  = 1
                values    = jsonencode(
                    {
                        digitalocean = {
                            apiToken = "53fccda1e07145890315f5e92641885017905b9e702f9e132efa47ca681ef647"
                        }
                        provider     = "digitalocean"
                        rbac         = {
                            create = true
                        }
                    }
                )
                version   = "2.20.5"
            },
        ]
        name                       = "external-dns"
        namespace                  = "external-dns"
        recreate_pods              = false
        render_subchart_notes      = true
        replace                    = false
        repository                 = "bitnami"
        reset_values               = false
        reuse_values               = false
        skip_crds                  = false
        status                     = "deployed"
        timeout                    = 300
        verify                     = false
        version                    = "2.20.5"
        wait                       = true

        set {
            name  = "provider"
            value = "digitalocean"
        }
        set {
            name  = "rbac.create"
            value = "true"
        }

        set_sensitive {
            name  = "digitalocean.apiToken"
            value = (sensitive value)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions For PRs`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
